package eu.zujev.milovidobot.lib

class Const {
    //TEXTS
    final static HELPTEXT = 'Я — самый обычный поэтический бот. ' +
            'Знаю, кроме стандартных /start и /help, четыре команды.\n' +
            '/стих запрашивает случайное стихотворение Ви Миловидовой;\n' +
            '/цитата генерирует случайную цитату из её произведений;\n' +
            '/автор выдаёт информацию об авторе стихов;\n' +
            '/донат предоставляет концы для сердечной поддержки поэта.\n\n' +
            'Команды /стих и /цитата можно продолжить фразой из стихотворения ' +
            'или цитаты. Если в базе эта фраза найдётся, я выдам то, ' +
            'что найду.\n\n' +
            'Наслаждайся!'
    final static INTROTEXT = 'Я — самый обычный поэтический бот.\n\n' +
            'Жми на кнопки под этим сообщением ' +
            'и наслаждайся бесконечным творчеством!'
    final static CALLBACKREPLIES = ['Пожалуйста!', 'Прошу!',
                                    'Нашёл!']
    final static CHANNEL_LINK = 'https://t.me/milovidovapoetry'
}
